#+TITLE: Basic Emacs Configuration
#+LANGUAGE: en
#+STARTUP: fold indent
   
#+begin_src emacs-lisp :tangle yes
  ;; -*- lexical-binding:t; -*-
#+end_src
* Org-mode
Org mode is Emacs' own markdown environment. It's extremely powerful.
#+begin_src emacs-lisp :tangle yes
  (use-package org
    :bind (("C-c l" . org-store-link)
	   ("C-c a" . org-agenda)
	   ("C-c c" . org-capture)
	   ("C-c b" . org-iswitchb)
	   ("C-c o" . org-indent-mode)
	   :map org-mode-map
	   ("C-c C-b" . org-beamer-select-environment)
	   ("<f9>" . org-babel-execute-src-block-maybe)
	   )
    :config (setq org-log-done 'time
		  org-log-done 'note
		  org-startup-folded 'show2levels
		  org-stuck-projects
		  '("+PROJECT/-MAYBE-DONE" ("TODO" "STARTED") nil "\\<IGNORE\\>")
		  org-clock-persist 'history
		  org-latex-pdf-process (list "latexmk -shell-escape -bibtex -f -pdf %f")
		  org-ellipsis "↴"
		  org-cite-csl-styles-dir "~/Zotero/styles/")
    ;; ▼, ↴, ⬎, ⤷, ⋱, ⤵
    (org-clock-persistence-insinuate)
    (org-babel-do-load-languages 'org-babel-load-languages
				 '((emacs-lisp . t)
				   (python . t)
				   (maxima . t)
				   (octave . t)
				   (matlab . t)))
    )

  (use-package org-special-block-extras
    :hook ((org-mode . org-special-block-extras-mode))
    )
  (use-package org-bullets
    :hook ((org-mode . (lambda () (org-bullets-mode t))))
    )

  (use-package ov)
  (use-package org-colored-text
    :load-path "~/.emacs.d/locpacks/org-colored-text"
    :config (org-link-set-parameters
	     "color"
	     (lambda (path)
	       "No follow action.")
	     (lambda (color description backend)
	       (cond
		((eq backend 'latex)                  ; added by TL
		 (format "{\\color{%s}%s}" color description)) ; added by TL
		((eq backend 'html)
		 (let ((rgb (assoc color color-name-rgb-alist))
		       r g b)
		   (if rgb
		       (progn
			 (setq r (* 255 (/ (nth 1 rgb) 65535.0))
			       g (* 255 (/ (nth 2 rgb) 65535.0))
			       b (* 255 (/ (nth 3 rgb) 65535.0)))
			 (format "<span style=\"color: rgb(%s,%s,%s)\">%s</span>"
				 (truncate r) (truncate g) (truncate b)
				 (or description color)))
		     (format "No Color RGB for %s" color))))))))

  ;; oer-reveal
  (use-package oer-reveal)

  (use-package laas
    :hook ((latex-mode . laas-mode)
           (tex-mode . laas-mode)
           (org-mode . laas-mode))
    :config (aas-global-mode)
    (aas-set-snippets 'laas-mode
      :cond #'laas-object-on-left-condition
      "tcr" (lambda () (interactive) (laas-wrap-previous-object "textcolor{red}")))
    ) 
#+end_src

#+RESULTS:
| laas-mode | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | (closure (t) nil (font-lock-add-keywords nil '((next-color-link (0 'org-link t))) t)) | (lambda nil (org-bullets-mode t)) | org-special-block-extras-mode | org-clock-load | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

